MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19176/mcu.h
#define                                 S06C4_bit           _BIT_ACCESS(LCDDATA24,6)
// LCDDATA30<S06C5>
extern volatile __bit                   S06C5               __at(0xE9B6);	// @ (0x1D36 * 8 + 6)
#define                                 S06C5_bit           _BIT_ACCESS(LCDDATA30,6)
// LCDDATA36<S06C6>
extern volatile __bit                   S06C6               __at(0xE9E6);	// @ (0x1D3C * 8 + 6)
#define                                 S06C6_bit           _BIT_ACCESS(LCDDATA36,6)
// LCDDATA42<S06C7>
extern volatile __bit                   S06C7               __at(0xEA16);	// @ (0x1D42 * 8 + 6)
#define                                 S06C7_bit           _BIT_ACCESS(LCDDATA42,6)
// LCDDATA0<S07C0>
extern volatile __bit                   S07C0               __at(0xE8C7);	// @ (0x1D18 * 8 + 7)
#define                                 S07C0_bit           _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S07C1>
extern volatile __bit                   S07C1               __at(0xE8F7);	// @ (0x1D1E * 8 + 7)
#define                                 S07C1_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S07C2>
extern volatile __bit                   S07C2               __at(0xE927);	// @ (0x1D24 * 8 + 7)
#define                                 S07C2_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S07C3>
extern volatile __bit                   S07C3               __at(0xE957);	// @ (0x1D2A * 8 + 7)
#define                                 S07C3_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA24<S07C4>
extern volatile __bit                   S07C4               __at(0xE987);	// @ (0x1D30 * 8 + 7)
#define                                 S07C4_bit           _BIT_ACCESS(LCDDATA24,7)
// LCDDATA30<S07C5>
extern volatile __bit                   S07C5               __at(0xE9B7);	// @ (0x1D36 * 8 + 7)
#define                                 S07C5_bit           _BIT_ACCESS(LCDDATA30,7)
// LCDDATA36<S07C6>
extern volatile __bit                   S07C6               __at(0xE9E7);	// @ (0x1D3C * 8 + 7)
#define                                 S07C6_bit           _BIT_ACCESS(LCDDATA36,7)
// LCDDATA42<S07C7>
extern volatile __bit                   S07C7               __at(0xEA17);	// @ (0x1D42 * 8 + 7)
#define                                 S07C7_bit           _BIT_ACCESS(LCDDATA42,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S08C1>
extern volatile __bit                   S08C1               __at(0xE8F8);	// @ (0x1D1F * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S08C2>
extern volatile __bit                   S08C2               __at(0xE928);	// @ (0x1D25 * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S08C3>
extern volatile __bit                   S08C3               __at(0xE958);	// @ (0x1D2B * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA25<S08C4>
extern volatile __bit                   S08C4               __at(0xE988);	// @ (0x1D31 * 8 + 0)
#define                                 S08C4_bit           _BIT_ACCESS(LCDDATA25,0)
// LCDDATA31<S08C5>
extern volatile __bit                   S08C5               __at(0xE9B8);	// @ (0x1D37 * 8 + 0)
#define                                 S08C5_bit           _BIT_ACCESS(LCDDATA31,0)
// LCDDATA37<S08C6>
extern volatile __bit                   S08C6               __at(0xE9E8);	// @ (0x1D3D * 8 + 0)
#define                                 S08C6_bit           _BIT_ACCESS(LCDDATA37,0)
// LCDDATA43<S08C7>
extern volatile __bit                   S08C7               __at(0xEA18);	// @ (0x1D43 * 8 + 0)
#define                                 S08C7_bit           _BIT_ACCESS(LCDDATA43,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S09C1>
extern volatile __bit                   S09C1               __at(0xE8F9);	// @ (0x1D1F * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S09C2>
extern volatile __bit                   S09C2               __at(0xE929);	// @ (0x1D25 * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S09C3>
extern volatile __bit                   S09C3               __at(0xE959);	// @ (0x1D2B * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA25<S09C4>
extern volatile __bit                   S09C4               __at(0xE989);	// @ (0x1D31 * 8 + 1)
#define                                 S09C4_bit           _BIT_ACCESS(LCDDATA25,1)
// LCDDATA31<S09C5>
extern volatile __bit                   S09C5               __at(0xE9B9);	// @ (0x1D37 * 8 + 1)
#define                                 S09C5_bit           _BIT_ACCESS(LCDDATA31,1)
// LCDDATA37<S09C6>
extern volatile __bit                   S09C6               __at(0xE9E9);	// @ (0x1D3D * 8 + 1)
#define                                 S09C6_bit           _BIT_ACCESS(LCDDATA37,1)
// LCDDATA43<S09C7>
extern volatile __bit                   S09C7               __at(0xEA19);	// @ (0x1D43 * 8 + 1)
#define                                 S09C7_bit           _BIT_ACCESS(LCDDATA43,1)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<S10C1>
extern volatile __bit                   S10C1               __at(0xE8FA);	// @ (0x1D1F * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<S10C2>
extern volatile __bit                   S10C2               __at(0xE92A);	// @ (0x1D25 * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<S10C3>
extern volatile __bit                   S10C3               __at(0xE95A);	// @ (0x1D2B * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA25<S10C4>
extern volatile __bit                   S10C4               __at(0xE98A);	// @ (0x1D31 * 8 + 2)
#define                                 S10C4_bit           _BIT_ACCESS(LCDDATA25,2)
// LCDDATA31<S10C5>
extern volatile __bit                   S10C5               __at(0xE9BA);	// @ (0x1D37 * 8 + 2)
#define                                 S10C5_bit           _BIT_ACCESS(LCDDATA31,2)
// LCDDATA37<S10C6>
extern volatile __bit                   S10C6               __at(0xE9EA);	// @ (0x1D3D * 8 + 2)
#define                                 S10C6_bit           _BIT_ACCESS(LCDDATA37,2)
// LCDDATA43<S10C7>
extern volatile __bit                   S10C7               __at(0xEA1A);	// @ (0x1D43 * 8 + 2)
#define                                 S10C7_bit           _BIT_ACCESS(LCDDATA43,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<S11C1>
extern volatile __bit                   S11C1               __at(0xE8FB);	// @ (0x1D1F * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<S11C2>
extern volatile __bit                   S11C2               __at(0xE92B);	// @ (0x1D25 * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<S11C3>
extern volatile __bit                   S11C3               __at(0xE95B);	// @ (0x1D2B * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA25<S11C4>
extern volatile __bit                   S11C4               __at(0xE98B);	// @ (0x1D31 * 8 + 3)
#define                                 S11C4_bit           _BIT_ACCESS(LCDDATA25,3)
// LCDDATA31<S11C5>
extern volatile __bit                   S11C5               __at(0xE9BB);	// @ (0x1D37 * 8 + 3)
#define                                 S11C5_bit           _BIT_ACCESS(LCDDATA31,3)
// LCDDATA37<S11C6>
extern volatile __bit                   S11C6               __at(0xE9EB);	// @ (0x1D3D * 8 + 3)
#define                                 S11C6_bit           _BIT_ACCESS(LCDDATA37,3)
// LCDDATA43<S11C7>
extern volatile __bit                   S11C7               __at(0xEA1B);	// @ (0x1D43 * 8 + 3)
#define                                 S11C7_bit           _BIT_ACCESS(LCDDATA43,3)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<S13C1>
extern volatile __bit                   S13C1               __at(0xE8FD);	// @ (0x1D1F * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<S13C2>
extern volatile __bit                   S13C2               __at(0xE92D);	// @ (0x1D25 * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<S13C3>
extern volatile __bit                   S13C3               __at(0xE95D);	// @ (0x1D2B * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA25<S13C4>
extern volatile __bit                   S13C4               __at(0xE98D);	// @ (0x1D31 * 8 + 5)
#define                                 S13C4_bit           _BIT_ACCESS(LCDDATA25,5)
// LCDDATA31<S13C5>
extern volatile __bit                   S13C5               __at(0xE9BD);	// @ (0x1D37 * 8 + 5)
#define                                 S13C5_bit           _BIT_ACCESS(LCDDATA31,5)
// LCDDATA37<S13C6>
extern volatile __bit                   S13C6               __at(0xE9ED);	// @ (0x1D3D * 8 + 5)
#define                                 S13C6_bit           _BIT_ACCESS(LCDDATA37,5)
// LCDDATA43<S13C7>
extern volatile __bit                   S13C7               __at(0xEA1D);	// @ (0x1D43 * 8 + 5)
#define                                 S13C7_bit           _BIT_ACCESS(LCDDATA43,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<S14C1>
extern volatile __bit                   S14C1               __at(0xE8FE);	// @ (0x1D1F * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<S14C2>
extern volatile __bit                   S14C2               __at(0xE92E);	// @ (0x1D25 * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<S14C3>
extern volatile __bit                   S14C3               __at(0xE95E);	// @ (0x1D2B * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA19,6)
// LCDDATA25<S14C4>
extern volatile __bit                   S14C4               __at(0xE98E);	// @ (0x1D31 * 8 + 6)
#define                                 S14C4_bit           _BIT_ACCESS(LCDDATA25,6)
// LCDDATA31<S14C5>
extern volatile __bit                   S14C5               __at(0xE9BE);	// @ (0x1D37 * 8 + 6)
#define                                 S14C5_bit           _BIT_ACCESS(LCDDATA31,6)
// LCDDATA37<S14C6>
extern volatile __bit                   S14C6               __at(0xE9EE);	// @ (0x1D3D * 8 + 6)
#define                                 S14C6_bit           _BIT_ACCESS(LCDDATA37,6)
// LCDDATA43<S14C7>
extern volatile __bit                   S14C7               __at(0xEA1E);	// @ (0x1D43 * 8 + 6)
#define                                 S14C7_bit           _BIT_ACCESS(LCDDATA43,6)
// LCDDATA1<S15C0>
extern volatile __bit                   S15C0               __at(0xE8CF);	// @ (0x1D19 * 8 + 7)
#define                                 S15C0_bit           _BIT_ACCESS(LCDDATA1,7)
// LCDDATA7<S15C1>
extern volatile __bit                   S15C1               __at(0xE8FF);	// @ (0x1D1F * 8 + 7)
#define                                 S15C1_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA13<S15C2>
extern volatile __bit                   S15C2               __at(0xE92F);	// @ (0x1D25 * 8 + 7)
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA13,7)
// LCDDATA19<S15C3>
extern volatile __bit                   S15C3               __at(0xE95F);	// @ (0x1D2B * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA19,7)
// LCDDATA25<S15C4>
extern volatile __bit                   S15C4               __at(0xE98F);	// @ (0x1D31 * 8 + 7)
#define                                 S15C4_bit           _BIT_ACCESS(LCDDATA25,7)
// LCDDATA31<S15C5>
extern volatile __bit                   S15C5               __at(0xE9BF);	// @ (0x1D37 * 8 + 7)
#define                                 S15C5_bit           _BIT_ACCESS(LCDDATA31,7)
// LCDDATA37<S15C6>
extern volatile __bit                   S15C6               __at(0xE9EF);	// @ (0x1D3D * 8 + 7)
#define                                 S15C6_bit           _BIT_ACCESS(LCDDATA37,7)
// LCDDATA43<S15C7>
extern volatile __bit                   S15C7               __at(0xEA1F);	// @ (0x1D43 * 8 + 7)
#define                                 S15C7_bit           _BIT_ACCESS(LCDDATA43,7)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0xE8D2);	// @ (0x1D1A * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA8<S18C1>
extern volatile __bit                   S18C1               __at(0xE902);	// @ (0x1D20 * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA14<S18C2>
extern volatile __bit                   S18C2               __at(0xE932);	// @ (0x1D26 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA14,2)
// LCDDATA20<S18C3>
extern volatile __bit                   S18C3               __at(0xE962);	// @ (0x1D2C * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA20,2)
// LCDDATA26<S18C4>
extern volatile __bit                   S18C4               __at(0xE992);	// @ (0x1D32 * 8 + 2)
#define                                 S18C4_bit           _BIT_ACCESS(LCDDATA26,2)
// LCDDATA32<S18C5>
extern volatile __bit                   S18C5               __at(0xE9C2);	// @ (0x1D38 * 8 + 2)
#define                                 S18C5_bit           _BIT_ACCESS(LCDDATA32,2)
// LCDDATA38<S18C6>
extern volatile __bit                   S18C6               __at(0xE9F2);	// @ (0x1D3E * 8 + 2)
#define                                 S18C6_bit           _BIT_ACCESS(LCDDATA38,2)
// LCDDATA44<S18C7>
extern volatile __bit                   S18C7               __at(0xEA22);	// @ (0x1D44 * 8 + 2)
#define                                 S18C7_bit           _BIT_ACCESS(LCDDATA44,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0xE8D3);	// @ (0x1D1A * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA8<S19C1>
extern volatile __bit                   S19C1               __at(0xE903);	// @ (0x1D20 * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<S19C2>
extern volatile __bit                   S19C2               __at(0xE933);	// @ (0x1D26 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA14,3)
// LCDDATA20<S19C3>
extern volatile __bit                   S19C3               __at(0xE963);	// @ (0x1D2C * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA20,3)
// LCDDATA26<S19C4>
extern volatile __bit                   S19C4               __at(0xE993);	// @ (0x1D32 * 8 + 3)
#define                                 S19C4_bit           _BIT_ACCESS(LCDDATA26,3)
// LCDDATA32<S19C5>
extern volatile __bit                   S19C5               __at(0xE9C3);	// @ (0x1D38 * 8 + 3)
#define                                 S19C5_bit           _BIT_ACCESS(LCDDATA32,3)
// LCDDATA38<S19C6>
extern volatile __bit                   S19C6               __at(0xE9F3);	// @ (0x1D3E * 8 + 3)
#define                                 S19C6_bit           _BIT_ACCESS(LCDDATA38,3)
// LCDDATA44<S19C7>
extern volatile __bit                   S19C7               __at(0xEA23);	// @ (0x1D44 * 8 + 3)
#define                                 S19C7_bit           _BIT_ACCESS(LCDDATA44,3)
// SSP1STAT<S2>
extern volatile __bit                   S2                  __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP1STAT,3)
// LCDDATA2<S20C0>
extern volatile __bit                   S20C0               __at(0xE8D4);	// @ (0x1D1A * 8 + 4)
#define                                 S20C0_bit           _BIT_ACCESS(LCDDATA2,4)
// LCDDATA8<S20C1>
extern volatile __bit                   S20C1               __at(0xE904);	// @ (0x1D20 * 8 + 4)
#define                                 S20C1_bit           _BIT_ACCESS(LCDDATA8,4)
// LCDDATA14<S20C2>
extern volatile __bit                   S20C2               __at(0xE934);	// @ (0x1D26 * 8 + 4)
#define                                 S20C2_bit           _BIT_ACCESS(LCDDATA14,4)
// LCDDATA20<S20C3>
extern volatile __bit                   S20C3               __at(0xE964);	// @ (0x1D2C * 8 + 4)
#define                                 S20C3_bit           _BIT_ACCESS(LCDDATA20,4)
// LCDDATA26<S20C4>
extern volatile __bit                   S20C4               __at(0xE994);	// @ (0x1D32 * 8 + 4)
#define                                 S20C4_bit           _BIT_ACCESS(LCDDATA26,4)
// LCDDATA32<S20C5>
extern volatile __bit                   S20C5               __at(0xE9C4);	// @ (0x1D38 * 8 + 4)
#define                                 S20C5_bit           _BIT_ACCESS(LCDDATA32,4)
// LCDDATA38<S20C6>
extern volatile __bit                   S20C6               __at(0xE9F4);	// @ (0x1D3E * 8 + 4)
#define                                 S20C6_bit           _BIT_ACCESS(LCDDATA38,4)
// LCDDATA44<S20C7>
extern volatile __bit                   S20C7               __at(0xEA24);	// @ (0x1D44 * 8 + 4)
#define                                 S20C7_bit           _BIT_ACCESS(LCDDATA44,4)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0xE8D6);	// @ (0x1D1A * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA8<S22C1>
extern volatile __bit                   S22C1               __at(0xE906);	// @ (0x1D20 * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA8,6)
// LCDDATA14<S22C2>
extern volatile __bit                   S22C2               __at(0xE936);	// @ (0x1D26 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA14,6)
// LCDDATA20<S22C3>
extern volatile __bit                   S22C3               __at(0xE966);	// @ (0x1D2C * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA20,6)
// LCDDATA26<S22C4>
extern volatile __bit                   S22C4               __at(0xE996);	// @ (0x1D32 * 8 + 6)
#define                                 S22C4_bit           _BIT_ACCESS(LCDDATA26,6)
// LCDDATA32<S22C5>
extern volatile __bit                   S22C5               __at(0xE9C6);	// @ (0x1D38 * 8 + 6)
#define                                 S22C5_bit           _BIT_ACCESS(LCDDATA32,6)
// LCDDATA38<S22C6>
extern volatile __bit                   S22C6               __at(0xE9F6);	// @ (0x1D3E * 8 + 6)
#define                                 S22C6_bit           _BIT_ACCESS(LCDDATA38,6)
// LCDDATA44<S22C7>
extern volatile __bit                   S22C7               __at(0xEA26);	// @ (0x1D44 * 8 + 6)
#define                                 S22C7_bit           _BIT_ACCESS(LCDDATA44,6)
// LCDDATA2<S23C0>
extern volatile __bit                   S23C0               __at(0xE8D7);	// @ (0x1D1A * 8 + 7)
#define                                 S23C0_bit           _BIT_ACCESS(LCDDATA2,7)
// LCDDATA8<S23C1>
extern volatile __bit                   S23C1               __at(0xE907);	// @ (0x1D20 * 8 + 7)
#define                                 S23C1_bit           _BIT_ACCESS(LCDDATA8,7)
// LCDDATA14<S23C2>
extern volatile __bit                   S23C2               __at(0xE937);	// @ (0x1D26 * 8 + 7)
#define                                 S23C2_bit           _BIT_ACCESS(LCDDATA14,7)
// LCDDATA20<S23C3>
extern volatile __bit                   S23C3               __at(0xE967);	// @ (0x1D2C * 8 + 7)
#define                                 S23C3_bit           _BIT_ACCESS(LCDDATA20,7)
// LCDDATA26<S23C4>
extern volatile __bit                   S23C4               __at(0xE997);	// @ (0x1D32 * 8 + 7)
#define                                 S23C4_bit           _BIT_ACCESS(LCDDATA26,7)
// LCDDATA32<S23C5>
extern volatile __bit                   S23C5               __at(0xE9C7);	// @ (0x1D38 * 8 + 7)
#define                                 S23C5_bit           _BIT_ACCESS(LCDDATA32,7)
// LCDDATA38<S23C6>
extern volatile __bit                   S23C6               __at(0xE9F7);	// @ (0x1D3E * 8 + 7)
#define                                 S23C6_bit           _BIT_ACCESS(LCDDATA38,7)
// LCDDATA44<S23C7>
extern volatile __bit                   S23C7               __at(0xEA27);	// @ (0x1D44 * 8 + 7)
#define                                 S23C7_bit           _BIT_ACCESS(LCDDATA44,7)
// LCDDATA3<S24C0>
extern volatile __bit                   S24C0               __at(0xE8D8);	// @ (0x1D1B * 8 + 0)
#define                                 S24C0_bit           _BIT_ACCESS(LCDDATA3,0)
// LCDDATA9<S24C1>
extern volatile __bit                   S24C1               __at(0xE908);	// @ (0x1D21 * 8 + 0)
#define                                 S24C1_bit           _BIT_ACCESS(LCDDATA9,0)
// LCDDATA15<S24C2>
extern volatile __bit                   S24C2               __at(0xE938);	// @ (0x1D27 * 8 + 0)
#define                                 S24C2_bit           _BIT_ACCESS(LCDDATA15,0)
// LCDDATA21<S24C3>
extern volatile __bit                   S24C3               __at(0xE968);	// @ (0x1D2D * 8 + 0)
#define                                 S24C3_bit           _BIT_ACCESS(LCDDATA21,0)
// LCDDATA27<S24C4>
extern volatile __bit                   S24C4               __at(0xE998);	// @ (0x1D33 * 8 + 0)
#define                                 S24C4_bit           _BIT_ACCESS(LCDDATA27,0)
// LCDDATA33<S24C5>
extern volatile __bit                   S24C5               __at(0xE9C8);	// @ (0x1D39 * 8 + 0)
#define                                 S24C5_bit           _BIT_ACCESS(LCDDATA33,0)
// LCDDATA39<S24C6>
extern volatile __bit                   S24C6               __at(0xE9F8);	// @ (0x1D3F * 8 + 0)
#define                                 S24C6_bit           _BIT_ACCESS(LCDDATA39,0)
// LCDDATA45<S24C7>
extern volatile __bit                   S24C7               __at(0xEA28);	// @ (0x1D45 * 8 + 0)
#define                                 S24C7_bit           _BIT_ACCESS(LCDDATA45,0)
// LCDDATA3<S25C0>
extern volatile __bit                   S25C0               __at(0xE8D9);	// @ (0x1D1B * 8 + 1)
#define                                 S25C0_bit           _BIT_ACCESS(LCDDATA3,1)
// LCDDATA9<S25C1>
extern volatile __bit                   S25C1               __at(0xE909);	// @ (0x1D21 * 8 + 1)
#define                                 S25C1_bit           _BIT_ACCESS(LCDDATA9,1)
// LCDDATA15<S25C2>
extern volatile __bit                   S25C2               __at(0xE939);	// @ (0x1D27 * 8 + 1)
#define                                 S25C2_bit           _BIT_ACCESS(LCDDATA15,1)
// LCDDATA21<S25C3>
